---
kind: type
id: T:Autodesk.Revit.DB.SymbolicCurveArray
source: html/a8ca9e0e-9838-96e4-5e6b-d5ffc11ea968.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray

An array that contains model curves.

## Syntax (C#)
```csharp
public class SymbolicCurveArray : APIObject,
	IEnumerable
```